{"keras_version": "2.1.3", "backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "name": "model_2", "output_layers": [["dense_6", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_2", "target_shape": [4, 16]}, "name": "reshape_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"trainable": true, "name": "permute_2", "dims": [2, 1]}, "name": "permute_2", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"padding": "same", "use_bias": true, "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "name": "conv1d_3", "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "kernel_size": [1]}, "name": "conv1d_3", "inbound_nodes": [[["permute_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true}, "name": "batch_normalization_1", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"padding": "same", "use_bias": true, "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "name": "conv1d_4", "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "kernel_size": [3]}, "name": "conv1d_4", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true}, "name": "batch_normalization_2", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"padding": "same", "use_bias": true, "strides": [1], "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "bias_constraint": null, "name": "conv1d_5", "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "kernel_size": [3]}, "name": "conv1d_5", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true}, "name": "batch_normalization_3", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["activation_1", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 64, "use_bias": true, "trainable": true, "activation": "linear", "bias_constraint": null, "name": "dense_4", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_4", "inbound_nodes": [[["flatten_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true}, "name": "batch_normalization_4", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 64, "use_bias": true, "trainable": true, "activation": "linear", "bias_constraint": null, "name": "dense_5", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "scale": true}, "name": "batch_normalization_5", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "use_bias": true, "trainable": true, "activation": "sigmoid", "bias_constraint": null, "name": "dense_6", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "name": "dense_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}]}, "class_name": "Model"}